In [1]:
import numpy as np
import pandas as pd

## Pandas Series Demonstration

In [2]:
# In pandas series you can pass set of data in data paramater and 
# in index param you can pass indexes for data.
pd.Series(data=np.arange(0,20), index=np.arange(20,40))

20     0
21     1
22     2
23     3
24     4
25     5
26     6
27     7
28     8
29     9
30    10
31    11
32    12
33    13
34    14
35    15
36    16
37    17
38    18
39    19
dtype: int64

In [3]:
my_d = {
    'a': 100,
    'b': 200,
    'c': 300
}
pd.Series(my_d)

a    100
b    200
c    300
dtype: int64

## Pandas DataFrame Demonstration

In [4]:
my_data = np.random.randn(3,4)
my_data

array([[ 0.10476876,  0.62454684,  0.16443444, -0.76314465],
       [-2.32531154, -0.9138969 , -0.10497923, -0.71246292],
       [ 0.19314233,  0.66482219, -0.78078111, -0.12130397]])

In [5]:
my_data_frame = pd.DataFrame(my_data,['R1', 'R2','R3'], ['C1','C2','C3','C4'])
my_data_frame

          C1        C2        C3        C4
R1  0.104769  0.624547  0.164434 -0.763145
R2 -2.325312 -0.913897 -0.104979 -0.712463
R3  0.193142  0.664822 -0.780781 -0.121304

In [6]:
my_data_frame['C1'] # Single Column.

R1    0.104769
R2   -2.325312
R3    0.193142
Name: C1, dtype: float64

In [7]:
my_data_frame[['C1', 'C4']] # Multiple Column Selection.

          C1        C4
R1  0.104769 -0.763145
R2 -2.325312 -0.712463
R3  0.193142 -0.121304

In [8]:
# Adding a new row.
my_data_frame['C5'] = my_data_frame['C1'] * my_data_frame['C4']
my_data_frame[['C5']]

          C5
R1 -0.079954
R2  1.656698
R3 -0.023429

In [9]:
# deleting a row from tabl
my_data_frame.drop('C2', axis=1, inplace=True)

# Inplace means the row is permenently deleted.